<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_1" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_105" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="Constant_106" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_107" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="StringTensorUnpack_2" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ShapeOf_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="9" name="Gather_6" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Range_9" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="Add_12" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="15" name="Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Range_14" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_76" type="Const" version="opset1">
			<data element_type="u8" shape="50" offset="28" size="50" />
			<output>
				<port id="0" precision="U8">
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="SpecialTokensSplit_77" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_79" type="Const" version="opset1">
			<data element_type="u8" shape="39" offset="78" size="39" />
			<output>
				<port id="0" precision="U8">
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_81" type="Const" version="opset1">
			<data element_type="u8" shape="0" offset="117" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="RegexNormalization_82" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>39</dim>
				</port>
				<port id="5" precision="U8">
					<dim>0</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="9" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="NormalizeUnicode_83" type="NormalizeUnicode" version="extension">
			<data normalization_form="NFD" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="7" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_85" type="Const" version="opset1">
			<data element_type="u8" shape="6" offset="118" size="6" />
			<output>
				<port id="0" precision="U8">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_87" type="Const" version="opset1">
			<data element_type="u8" shape="0" offset="117" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="RegexNormalization_88" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>6</dim>
				</port>
				<port id="5" precision="U8">
					<dim>0</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="9" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="CaseFold_89" type="CaseFold" version="extension">
			<data encoding="utf-8" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="7" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_91" type="Const" version="opset1">
			<data element_type="u8" shape="3" offset="124" size="3" />
			<output>
				<port id="0" precision="U8">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="RegexSplit_92" type="RegexSplit" version="extension">
			<data behaviour="remove" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_94" type="Const" version="opset1">
			<data element_type="u8" shape="202" offset="127" size="202" />
			<output>
				<port id="0" precision="U8">
					<dim>202</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="RegexSplit_95" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>202</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_97" type="Const" version="opset1">
			<data element_type="u8" shape="1189536" offset="329" size="1189536" />
			<output>
				<port id="0" precision="U8">
					<dim>1189536</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StringTensorUnpack_98" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>1189536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_99" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1189865" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="34" name="WordpieceTokenizer_100" type="WordpieceTokenizer" version="extension">
			<data suffix_indicator="##" max_bytes_per_word="100" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I64" />
			</input>
			<output>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Subtract_101" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_102" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1189873" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="37" name="Minimum_103" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Add_104" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_108" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="40" name="Constant_109" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="41" name="Constant_110" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1189877" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_111" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1189881" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="CombineSegments_112" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32" />
				<port id="7" precision="I32" />
				<port id="8" precision="I32">
					<dim>1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="13" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="14" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="15" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Subtract_113" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_114" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="46" name="ReduceMax_115" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="47" name="Constant_116" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="48" name="RaggedToDense_117" type="RaggedToDense" version="extension">
			<data pad_right="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convert_118" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Convert_118" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_119" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="53" name="RaggedToDense_120" type="RaggedToDense" version="extension">
			<data pad_right="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="RaggedToDense_120.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="token_type_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="RaggedToDense_117.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Result_121" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="55" name="Result_122" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="51" name="Result_123" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="43" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="43" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="43" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="3" to-layer="18" to-port="4" />
		<edge from-layer="5" from-port="2" to-layer="18" to-port="3" />
		<edge from-layer="5" from-port="1" to-layer="18" to-port="2" />
		<edge from-layer="6" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="2" />
		<edge from-layer="9" from-port="3" to-layer="14" to-port="0" />
		<edge from-layer="9" from-port="3" to-layer="11" to-port="1" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="2" />
		<edge from-layer="11" from-port="3" to-layer="18" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="1" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="2" />
		<edge from-layer="16" from-port="3" to-layer="18" to-port="1" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="5" />
		<edge from-layer="18" from-port="6" to-layer="28" to-port="0" />
		<edge from-layer="18" from-port="7" to-layer="28" to-port="1" />
		<edge from-layer="18" from-port="11" to-layer="21" to-port="3" />
		<edge from-layer="18" from-port="10" to-layer="21" to-port="2" />
		<edge from-layer="18" from-port="9" to-layer="21" to-port="1" />
		<edge from-layer="18" from-port="8" to-layer="21" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="21" to-port="4" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="5" />
		<edge from-layer="21" from-port="6" to-layer="22" to-port="0" />
		<edge from-layer="21" from-port="7" to-layer="22" to-port="1" />
		<edge from-layer="21" from-port="8" to-layer="22" to-port="2" />
		<edge from-layer="21" from-port="9" to-layer="22" to-port="3" />
		<edge from-layer="22" from-port="5" to-layer="25" to-port="1" />
		<edge from-layer="22" from-port="7" to-layer="25" to-port="3" />
		<edge from-layer="22" from-port="6" to-layer="25" to-port="2" />
		<edge from-layer="22" from-port="4" to-layer="25" to-port="0" />
		<edge from-layer="23" from-port="0" to-layer="25" to-port="4" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="5" />
		<edge from-layer="25" from-port="6" to-layer="26" to-port="0" />
		<edge from-layer="25" from-port="7" to-layer="26" to-port="1" />
		<edge from-layer="25" from-port="8" to-layer="26" to-port="2" />
		<edge from-layer="25" from-port="9" to-layer="26" to-port="3" />
		<edge from-layer="26" from-port="4" to-layer="28" to-port="2" />
		<edge from-layer="26" from-port="5" to-layer="28" to-port="3" />
		<edge from-layer="26" from-port="6" to-layer="28" to-port="4" />
		<edge from-layer="26" from-port="7" to-layer="28" to-port="5" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="6" />
		<edge from-layer="28" from-port="12" to-layer="30" to-port="5" />
		<edge from-layer="28" from-port="11" to-layer="30" to-port="4" />
		<edge from-layer="28" from-port="10" to-layer="30" to-port="3" />
		<edge from-layer="28" from-port="7" to-layer="30" to-port="0" />
		<edge from-layer="28" from-port="8" to-layer="30" to-port="1" />
		<edge from-layer="28" from-port="9" to-layer="30" to-port="2" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="6" />
		<edge from-layer="30" from-port="10" to-layer="34" to-port="3" />
		<edge from-layer="30" from-port="11" to-layer="34" to-port="4" />
		<edge from-layer="30" from-port="7" to-layer="34" to-port="0" />
		<edge from-layer="30" from-port="8" to-layer="34" to-port="1" />
		<edge from-layer="30" from-port="9" to-layer="34" to-port="2" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="34" to-port="5" />
		<edge from-layer="32" from-port="2" to-layer="34" to-port="6" />
		<edge from-layer="32" from-port="3" to-layer="34" to-port="7" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="8" />
		<edge from-layer="34" from-port="9" to-layer="43" to-port="3" />
		<edge from-layer="34" from-port="11" to-layer="43" to-port="5" />
		<edge from-layer="34" from-port="9" to-layer="38" to-port="0" />
		<edge from-layer="34" from-port="9" to-layer="35" to-port="1" />
		<edge from-layer="34" from-port="10" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="43" to-port="4" />
		<edge from-layer="39" from-port="0" to-layer="43" to-port="6" />
		<edge from-layer="40" from-port="0" to-layer="43" to-port="7" />
		<edge from-layer="41" from-port="0" to-layer="43" to-port="8" />
		<edge from-layer="42" from-port="0" to-layer="43" to-port="9" />
		<edge from-layer="43" from-port="15" to-layer="53" to-port="2" />
		<edge from-layer="43" from-port="14" to-layer="53" to-port="1" />
		<edge from-layer="43" from-port="13" to-layer="53" to-port="0" />
		<edge from-layer="43" from-port="12" to-layer="48" to-port="2" />
		<edge from-layer="43" from-port="11" to-layer="48" to-port="1" />
		<edge from-layer="43" from-port="10" to-layer="48" to-port="0" />
		<edge from-layer="43" from-port="10" to-layer="44" to-port="1" />
		<edge from-layer="43" from-port="11" to-layer="44" to-port="0" />
		<edge from-layer="44" from-port="2" to-layer="46" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="1" />
		<edge from-layer="46" from-port="2" to-layer="48" to-port="3" />
		<edge from-layer="46" from-port="2" to-layer="53" to-port="3" />
		<edge from-layer="47" from-port="0" to-layer="48" to-port="4" />
		<edge from-layer="48" from-port="5" to-layer="56" to-port="0" />
		<edge from-layer="48" from-port="6" to-layer="49" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="51" to-port="0" />
		<edge from-layer="52" from-port="0" to-layer="53" to-port="4" />
		<edge from-layer="53" from-port="5" to-layer="54" to-port="0" />
		<edge from-layer="54" from-port="1" to-layer="55" to-port="0" />
		<edge from-layer="56" from-port="1" to-layer="57" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<handle_special_tokens_with_re value="False" />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2024.5.0.0.dev20241022" />
		<openvino_version value="2024.5.0.dev20241022" />
		<original_tokenizer_class value="&lt;class 'transformers.models.bert.tokenization_bert_fast.BertTokenizerFast'>" />
		<pad_token_id value="0" />
		<sentencepiece_version value="0.2.0" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tiktoken_version value="0.6.0" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.19.1" />
		<transformers_version value="4.44.2" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="True" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="False" />
	</rt_info>
</net>
